using Streetcode.DAL.Entities.Timeline;
using Streetcode.DAL.Enums;
using Streetcode.WebApi.InitialData.SeederExtensions;
using Streetcode.DAL.Persistence;

namespace Streetcode.WebApi.InitialData.TimelineItemsSeeder
{
    public class TimelineItemsSeeder
    {
        public static async Task FillSeedAsync(
     StreetcodeDbContext context)
        {
            var entities = new List<TimelineItem>
        {
            new()
            {
                Date = new DateTime(1831, 1, 1),
                Title = "Перші роки в Петербурзі",
                Description = "Переїхавши 1831 року з Вільна до Петербурга, поміщик П. Енгельгардт узяв із собою Шевченка, " +
            "а щоб згодом мати зиск на художніх творах власного «покоєвого художника», підписав контракт й віддав його" +
            " в науку на чотири роки до живописця В. Ширяєва, у якого й замешкав Тарас до 1838 року.",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1830, 1, 1),
                Title = "Учень Петербурзької академії мистецтв",
                Description = "Засвідчивши свою відпускну в петербурзькій Палаті цивільного суду, Шевченко став учнем Академії мистецтв," +
                    " де його наставником став К. Брюллов. За словами Шевченка: «настала найсвітліша доба його життя, незабутні, золоті дні»" +
                    " навчання в Академії мистецтв, яким він присвятив у 1856 році автобіографічну повість «Художник».",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1832, 1, 1),
                Title = "Перші роки в Петербурзі",
                Description = "Переїхавши 1831 року з Вільна до Петербурга, поміщик П. Енгельгардт узяв із собою Шевченка, " +
                            "а щоб згодом мати зиск на художніх творах власного «покоєвого художника», підписав контракт й віддав його" +
                            " в науку на чотири роки до живописця В. Ширяєва, у якого й замешкав Тарас до 1838 року.",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1833, 1, 1),
                Title = "Перші роки в Петербурзі",
                Description = "Переїхавши 1831 року з Вільна до Петербурга, поміщик П. Енгельгардт узяв із собою Шевченка, " +
                            "а щоб згодом мати зиск на художніх творах власного «покоєвого художника», підписав контракт й віддав його" +
                            " в науку на чотири роки до живописця В. Ширяєва, у якого й замешкав Тарас до 1838 року.",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1834, 1, 1),
                Title = "Перші роки в Петербурзі",
                Description = "Переїхавши 1831 року з Вільна до Петербурга, поміщик П. Енгельгардт узяв із собою Шевченка, " +
                            "а щоб згодом мати зиск на художніх творах власного «покоєвого художника», підписав контракт й віддав його" +
                            " в науку на чотири роки до живописця В. Ширяєва, у якого й замешкав Тарас до 1838 року.",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1835, 1, 1),
                Title = "Перші роки в Петербурзі",
                Description = "Переїхавши 1831 року з Вільна до Петербурга, поміщик П. Енгельгардт узяв із собою Шевченка, " +
                            "а щоб згодом мати зиск на художніх творах власного «покоєвого художника», підписав контракт й віддав його" +
                            " в науку на чотири роки до живописця В. Ширяєва, у якого й замешкав Тарас до 1838 року.",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1836, 1, 1),
                Title = "Перші роки в Петербурзі",
                Description = "Переїхавши 1831 року з Вільна до Петербурга, поміщик П. Енгельгардт узяв із собою Шевченка, " +
                            "а щоб згодом мати зиск на художніх творах власного «покоєвого художника», підписав контракт й віддав його" +
                            " в науку на чотири роки до живописця В. Ширяєва, у якого й замешкав Тарас до 1838 року.",
                StreetcodeId = 1
            },
            new ()
            {
                Date = new DateTime(1997, 7, 5),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "Народився",
                Description = "Цього дня Роман народився в Києві. В родині активіста руху проти знищення історичної забудови «Збережи старий Київ», добровольця Тараса Ратушного та письменниці, журналістки Світлани Поваляєвої. Зростав та вчився у столиці.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2012, 1, 1),
                Title = "Обирає фах",
                DateViewPattern = DateViewPattern.Year,
                Description = "Коли прийшов час обирати фах, Роман зупиняє свій вибір на юридичному та вступає до Фінансово-правового коледжу в Києві.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2013, 11, 30),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "Проти несправедливості",
                Description = "Роману — 15. Україні — 22. І обох непокоїть несправедливість. Починається Революція гідності. Юний Ратушний — один з перших її учасників в усіх найгарячіших епізодах протистояння. У ніч на 30 листопада його разом з іншими студентами вперше побив «Беркут».",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2013, 12, 30),
                DateViewPattern = DateViewPattern.MonthYear,
                Title = "«Знаю, що роблю»",
                Description = "Під час штурму Євромайдану силовиками Роман хоч і постраждав, але вистояв разом з іншими гідними. «Тато. Знаю, що я роблю», — спокійно відповідає батькові та йде туди, де найгарячіше.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2014, 1, 1),
                DateViewPattern = DateViewPattern.Year,
                Title = "Боротьба лише починається",
                Description = "Найзапекліша фаза Революції гідності у лютому. Силовий тиск проти активістів поновлюється. Роман знову в епіцентрі. Його боротьба тільки починається. У грудні бере активну участь у протестах за кадрові зміни в Міністерстві внутрішніх справ України та пришвидшення розслідувань злочинів, скоєних у 2013–2014 роках на Євромайдані та в Одесі.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2018, 1, 1),
                DateViewPattern = DateViewPattern.Year,
                Title = "Захистимо Протасів Яр",
                Description = "Роман очолює ініціативу «Захистимо Протасів Яр», з 2019 року це однойменна громадська організація. Разом з однодумцями активно виступає за збереження зеленої зони у Протасовому Яру в центрі Києва та проти побудови багатоповерхівок на зелених схилах.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2019, 1, 1),
                DateViewPattern = DateViewPattern.Year,
                Title = "Погрози",
                Description = "Через погрози фізичною розправою та викраденням, про які Роман заявив у жовтні 2019-го, йому доводиться деякий час переховуватися.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2020, 6, 1),
                DateViewPattern = DateViewPattern.SeasonYear,
                Title = "Перемога в суді",
                Description = "Конфлікт та протистояння забудовнику ТОВ «Дайтона Груп» в суді нарешті закінчуються перемогою активістів на чолі з Ратушним. 27 червня 2020 року Київська міська рада повертає земельній ділянці площею 3,25 га у Протасовому Яру статус зелених насаджень.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2020, 12, 30),
                DateViewPattern = DateViewPattern.SeasonYear,
                Title = "Досвід політика",
                Description = "Роман балотується на виборах депутатів Київради від блоку Віталія Кличка, не будучи членом партії «УДАР». На думку членів ГО «Захистимо Протасів Яр», така взаємодія мала б забезпечити представництво в міській раді громадських ініціатив, а не тільки партій. Вибори Роман програє, не подолавши 25-відсоткової виборчої квоти, але набувши певного досвіду політика.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2021, 1, 1),
                DateViewPattern = DateViewPattern.Year,
                Title = "Домашній арешт",
                Description = "Роман активно підтримує виступи проти арештів активістів: одесита Стерненка та затриманих у «справі Шеремета» Антоненка, Дугарь, Кузьменко. Проти нього фабрикують справу. У соцмережах її охрестили «чорний квадрат» через суцільну чорну пляму на відео з камер, в якому нібито побачили Романа. На підставі сфабрикованих доказів висувають підозру в хуліганстві та відправляють під домашній арешт.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2021, 1, 1),
                DateViewPattern = DateViewPattern.Year,
                Title = "Сфабрикована справа",
                Description = "Громадську діяльність під домашнім арештом не полишає. Знімає жартівливе відео про життя з електронним браслетом. Свій арешт пов’язує з власною діяльністю на захист Протасового Яру. «Навіть якби мене на тій акції не було, вони б придумали щось інше», — каже про фабрикування справи. Після подання апеляції адвокати активіста виграли суд — з Ратушного зняли всі обвинувачення.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2022, 2, 24),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "Підрозділ Протасового",
                Description = "Свій Протасів та свій Київ з початком повномасштабного вторгнення Росії Роман добровольцем захищає у лавах Збройних сил України в підрозділі «Протасового Яру». Спершу була Київщина, потім — Сумщина, де він брав участь у деокупації населених пунктів області, зокрема Тростянця.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2022, 3, 1),
                DateViewPattern = DateViewPattern.SeasonYear,
                Title = "Холодний Яр",
                Description = "На початку квітня вступає до розвідувального взводу 2-го мотопіхотного батальйону 93-ї окремої механізованої бригади ЗСУ «Холодний Яр». Цей батальйон обороняв українську землю в Харківській області, зокрема в районі Ізюму.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2022, 6, 9),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "Завжди 24",
                Description = "Роман Ратушний не дожив трохи менше місяця до своїх 25 років. 9 червня 2022-го під Ізюмом на Харківщині він загинув, потрапивши у ворожу засідку. До кінця на бойовому завданні, вистежуючи ворожий танк. Тіло Романа декілька днів було на непідконтрольній території, доки його командир з позивним Боб зміг його забрати. Чекав сильної грози, щоб не бути поміченим ворогом.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2022, 6, 18),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "Байкове. Вічність",
                Description = "Романа Ратушного поховали на Байковому кладовищі в Києві. Попрощатися прийшли сотні людей. Батьки, родичі, військові, знайомі та друзі Романа, громадяни, активісти, представники влади. Прощалися з героєм у Михайлівському соборі та на Майдані. Перед похороном над труною з його тілом розгорнули прапор України.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2022, 9, 8),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "Вулиця Ратушного",
                Description = "На засіданні Київради одноголосно підтримали перейменування вулиці Волгоградської у Солом'янському районі столиці на вулицю Романа Ратушного. Таку пропозицію подав письменник Євген Лір.",
                StreetcodeId = 2
            },
            new ()
            {
                Date = new DateTime(2022, 9, 13),
                DateViewPattern = DateViewPattern.DateMonthYear,
                Title = "За мужність",
                Description = "Романа Ратушного посмертно нагородили орденом «За мужність» III ступеня — за особисту мужність і самовіддані дії, виявлені у захисті державного суверенітету та територіальної цілісності України, вірність військовій присязі.",
                StreetcodeId = 2
            }
        };

            await context.TimelineItems.SeedIfEmptyAsync(
                entities,
                context);
        }
    }
}
